  {
      "Grand Foyer": {
        "name": "Grand Foyer",
        "description": "The entryway to the estate, with high ceilings and a grand staircase. It's unwelcoming yet mesmerizing.",
        "ambiance": "The echo of footsteps on the marble floor and a cool draft that chills to the bone.",
        "affectation_moisture_value": -1,
        "affectation_moisture_reasoning": "Well-preserved area, with little decay.",
        "affectation_size_value": 2,
        "affectation_size_reasoning": "Vast and grandiose, with a sense of openness.",
        "affectation_light_value": 1,
        "affectation_light_reasoning": "Dimly lit by a grand chandelier, casting long shadows.",
        "affectation_sound_value": 1,
        "affectation_sound_reasoning": "High ceilings amplify sounds, making footsteps and whispers echo."
      },
      "Library of Whispers": {
        "name": "Library of Whispers",
        "description": "Shelves of ancient books tower around you. Some say the knowledge within can both enlighten and drive one to madness.",
        "ambiance": "Muffled silence broken only by the faint sound of turning pages, as if by invisible hands.",
        "affectation_moisture_value": 0,
        "affectation_moisture_reasoning": "A balanced environment preserving the old tomes.",
        "affectation_size_value": 1,
        "affectation_size_reasoning": "Large enough to house thousands of books, but an air of claustrophobia lingers.",
        "affectation_light_value": -1,
        "affectation_light_reasoning": "Sporadic candlelight casts more shadow than illumination.",
        "affectation_sound_value": -2,
        "affectation_sound_reasoning": "An uncanny silence dominates, as if the very air mutes noises."
      },
      "Abandoned Conservatory": {
        "name": "Abandoned Conservatory",
        "description": "Once a place of lush greenery, now only the twisted remains of plants exist here.",
        "ambiance": "The glass ceiling creates a disconcerting greenhouse effect. You can barely see the sky through the grime.",
        "affectation_moisture_value": 2,
        "affectation_moisture_reasoning": "High levels of humidity and decay from the remaining vegetation.",
        "affectation_size_value": 0,
        "affectation_size_reasoning": "A middling space, overgrown with dry vines and broken pots.",
        "affectation_light_value": -2,
        "affectation_light_reasoning": "Overcast with sickly light filtered through dirty glass.",
        "affectation_sound_value": 0,
        "affectation_sound_reasoning": "The air is thick, dulling sound but for the crunch of withered leaves."
      },
      "Portrait Hall": {
        "name": "Portrait Hall",
        "description": "A long hallway adorned with portraits whose eyes seem to follow you with every step.",
        "ambiance": "A chilly draft works its way through the hall, making the hair on your neck stand up.",
        "affectation_moisture_value": -2,
        "affectation_moisture_reasoning": "Dry and dusty, with a faint smell of old paint.",
        "affectation_size_value": -1,
        "affectation_size_reasoning": "Cramped and narrow, with little room to move.",
        "affectation_light_value": 0,
        "affectation_light_reasoning": "The light flickers intermittently, casting peculiar shadows.",
        "affectation_sound_value": 2,
        "affectation_sound_reasoning": "Every footstep seems louder here, hard to ignore or mask."
      },
      "Gallery of Shadows": {
        "name": "Gallery of Shadows",
        "description": "A room filled with various sculptures, each casting an eerie shadow that seems to stretch and shrink of its own will.",
        "ambiance": "Dimly lit by wall sconces that flutter as if in an unfelt breeze.",
        "affectation_moisture_value": 1,
        "affectation_moisture_reasoning": "You can feel the dampness in the air, breathing life into the shadows.",
        "affectation_size_value": -1,
        "affectation_size_reasoning": "Although not large, the shifting shadows play tricks on your perception of space.",
        "affectation_light_value": -3,
        "affectation_light_reasoning": "The light hardly penetrates the darkness, leaving much to the imagination.",
        "affectation_sound_value": -1,
        "affectation_sound_reasoning": "The busts and figures seem to absorb sound, creating a heavy silence."
      },
      "Dining Room of Despair": {
        "name": "Dining Room of Despair",
        "description": "An opulent dining room with a long table set for a macabre feast that was never to be.",
        "ambiance": "Echoes of ghostly laughter and the clinking of spectral cutlery fill the air.",
        "affectation_moisture_value": -1,
        "affectation_moisture_reasoning": "The air is unnaturally dry, as if all life has been drained from it.",
        "affectation_size_value": 1,
        "affectation_size_reasoning": "The grandeur of the estate is encapsulated by the ample space.",
        "affectation_light_value": -1,
        "affectation_light_reasoning": "Gloomy and dim, lit only by the flickering candles on the table.",
        "affectation_sound_value": 1,
        "affectation_sound_reasoning": "Muffled sounds of a banquet never enjoyed occasionally surface."
      },
      "Specter's Ballroom": {
        "name": "Specter's Ballroom",
        "description": "A vast ballroom with a glossy floor that reflects the specters dancing eternally.",
        "ambiance": "Haunting melodies of a ghostly orchestra resonate throughout the neglected space.",
        "affectation_moisture_value": 0,
        "affectation_moisture_reasoning": "Neither damp nor dry, the room is suspended in an eternal equilibrium.",
        "affectation_size_value": 2,
        "affectation_size_reasoning": "Expansive enough to host otherworldly celebrations.",
        "affectation_light_value": 0,
        "affectation_light_reasoning": "Ephemeral glow from unseen sources casts an otherworldly light.",
        "affectation_sound_value": 2,
        "affectation_sound_reasoning": "The acoustics of the ballroom amplify the haunting symphony."
      },
      "The Shrieking Study": {
        "name": "The Shrieking Study",
        "description": "The study's walls are lined with forbidden texts and the anguished wails of the past.",
        "ambiance": "The air vibrates with the collective screams of tormented souls trapped within the books.",
        "affectation_moisture_value": -2,
        "affectation_moisture_reasoning": "The withering of ancient pages leaves a stale, desiccated air.",
        "affectation_size_value": -2,
        "affectation_size_reasoning": "Cramped with towering bookshelves, leaving little space to move.",
        "affectation_light_value": -2,
        "affectation_light_reasoning": "Darkness pervades, with only the faintest light from the embers in the fireplace.",
        "affectation_sound_value": -2,
        "affectation_sound_reasoning": "Quiet except for the unsettling sound of boundless sorrow."
      },
      "Ghastly Guest Quarters": {
        "name": "Ghastly Guest Quarters",
        "description": "Guest rooms that have become a ghastly resting place for those who never checked out.",
        "ambiance": "The ethereal sensation of unseen presences fills the air with a cold foreboding.",
        "affectation_moisture_value": 1,
        "affectation_moisture_reasoning": "The lingering spirits bring with them a damp chill that permeates the room.",
        "affectation_size_value": 0,
        "affectation_size_reasoning": "Rooms of varying sizes, each haunted by its tragic past.",
        "affectation_light_value": -1,
        "affectation_light_reasoning": "Tenebrous shadows hang heavily in the air, masking the light.",
        "affectation_sound_value": 0,
        "affectation_sound_reasoning": "Silent, except for the occasional unsettling creak of a bed frame." 
      },
      "Phantom Observatory": {
        "name": "Phantom Observatory",
        "description": "An observatory with a cracked dome, where the stars seem to gaze back with a life of their own.",
        "ambiance": "The feeling of being watched pervades, as whispers from the void occasionally slip through.",
        "affectation_moisture_value": -2,
        "affectation_moisture_reasoning": "The air is bone dry, filled with the cold of space.",
        "affectation_size_value": 1,
        "affectation_size_reasoning": "The dome encloses a vast view of the heavens, giving a sense of infinite space.",
        "affectation_light_value": 1,
        "affectation_light_reasoning": "The celestial lights provide a dim, otherworldly illumination.",
        "affectation_sound_value": -2,
        "affectation_sound_reasoning": "The silence of the void is hauntingly omnipresent."
      },
      "Chapel of Night": {
        "name": "Chapel of Night",
        "description": "An old chapel filled with dark iconography, where unspeakable rites were performed under the moon.",
        "ambiance": "A suffocating silence, pierced only by the occasional caw of a distant crow.",
        "affectation_moisture_value": -1,
        "affectation_moisture_reasoning": "The arid atmosphere is charged with ancient incantations.",
        "affectation_size_value": 0,
        "affectation_size_reasoning": "A modestly sized holy place turned unholy.",
        "affectation_light_value": -2,
        "affectation_light_reasoning": "Moonlight filters through the stained glass, casting unsettling patterns.",
        "affectation_sound_value": -2,
        "affectation_sound_reasoning": "Whispers of the past prayers create a lingering hush."
      },
      "Mirror Maze": {
        "name": "Mirror Maze",
        "description": "A labyrinth of mirrors that disorients and distorts reality.",
        "ambiance": "The unsettling sound of footsteps that may not be your own.",
        "affectation_moisture_value": -2,
        "affectation_moisture_reasoning": "The air is dry, the glass surfaces untouched by condensation.",
        "affectation_size_value": -1,
        "affectation_size_reasoning": "The mirrors create an illusion of endless space, yet you feel trapped.",
        "affectation_light_value": 2,
        "affectation_light_reasoning": "Light is reflected and refracted in every direction, making it impossible to trust your eyes.",
        "affectation_sound_value": -1,
        "affectation_sound_reasoning": "The subtlest sounds are bounced back from every angle, creating confusion."
      },
      "Serpentine Corridor": {
        "name": "Serpentine Corridor",
        "description": "A snaking corridor that seems to have no end, adorned with serpentine motifs.",
        "ambiance": "The hiss of imagined slithers always seems to be just around the corner.",
        "affectation_moisture_value": 0,
        "affectation_moisture_reasoning": "Neither dry nor damp, the corridor is as it has always been.",
        "affectation_size_value": -2,
        "affectation_size_reasoning": "The narrow hall constricts like the coils of a snake.",
        "affectation_light_value": -1,
        "affectation_light_reasoning": "Dim torches cast eerie shadows that dance like serpents on the walls.",
        "affectation_sound_value": 0,
        "affectation_sound_reasoning": "Every step is accompanied by a sound that may be your own echo - or may not."
      },
      "The Whispering Closet": {
        "name": "The Whispering Closet",
        "description": "A narrow closet filled with hanging garments that flutter as if in a breeze, whispering secrets from the past.",
        "ambiance": "The air is thick with the murmurs of bygone days, sending shivers down the spine.",
        "affectation_moisture_value": -1,
        "affectation_moisture_reasoning": "The dryness preserves the relics of wardrobes long past.",
        "affectation_size_value": -2,
        "affectation_size_reasoning": "Claustrophobic and confined, barely enough for one person to stand.",
        "affectation_light_value": -2,
        "affectation_light_reasoning": "Devoid of light, as no candle can seem to stay lit within these walls.",
        "affectation_sound_value": 1,
        "affectation_sound_reasoning": "Filled with the rustling of silks and the faint echoes of whispered secrets."
      },
      "The Clockwork Corridor": {
        "name": "The Clockwork Corridor",
        "description": "Lined with ancient, ornate clocks that tick synchronously, the passage seems to warp time itself.",
        "ambiance": "The relentless ticking is punctuated by the occasional chime, marking time that has no meaning here.",
        "affectation_moisture_value": 0,
        "affectation_moisture_reasoning": "Neither dry nor damp, the corridor is untouched by the elements.",
        "affectation_size_value": 0,
        "affectation_size_reasoning": "An unremarkable stretch, yet there's an illusion of endlessness.",
        "affectation_light_value": 0,
        "affectation_light_reasoning": "Constant, even lighting from unseen sources casts no shadow.",
        "affectation_sound_value": 2,
        "affectation_sound_reasoning": "The ticking of clocks is omnipresent, encompassing all who wander."
      },
      "The Seance Chamber": {
        "name": "The Seance Chamber",
        "description": "A room with a round table at the center, surrounded by chairs that seem to be occupied by invisible attendees.",
        "ambiance": "A heavy sense of expectation hangs in the air, as though a spectral gathering is about to commence.",
        "affectation_moisture_value": -1,
        "affectation_moisture_reasoning": "A dry atmosphere, heightened by the aroma of sage and myrrh.",
        "affectation_size_value": -1,
        "affectation_size_reasoning": "Intimate and close, designed to keep the circle of energies contained.",
        "affectation_light_value": -1,
        "affectation_light_reasoning": "Lit only by the flickering flames of candles placed at cardinal points.",
        "affectation_sound_value": -1,
        "affectation_sound_reasoning": "Silent, save for the occasional whisper of a long-dead voice."
      },
      "The Forgotten Atelier": {
        "name": "The Forgotten Atelier",
        "description": "An artist's studio covered in sheets, with unfinished paintings that seem to stare at the intruder.",
        "ambiance": "An unsettling stillness pervades, broken only by the drip of what might be paint - or something darker.",
        "affectation_moisture_value": 1,
        "affectation_moisture_reasoning": "The scent of oil paints mixes with a faint dampness that clings to the covered furniture.",
        "affectation_size_value": 0,
        "affectation_size_reasoning": "Spacious enough for creative work, yet every corner seems shrouded in mystery.",
        "affectation_light_value": 1,
        "affectation_light_reasoning": "Natural light floods in from a skylight, casting a stark brightness.",
        "affectation_sound_value": -1,
        "affectation_sound_reasoning": "The quiet is so intense that the scrape of an easel becomes a thunderous noise."
      },
      "Vortex Staircase": {
        "name": "Vortex Staircase",
        "description": "A spiraling set of steps that seems to climb into endless darkness. Each step resonates with a surreal echo.",
        "ambiance": "The sound of footsteps is distorted as if coming from everywhere and nowhere, and the air swirls with a mystic energy.",
        "affectation_moisture_value": -1,
        "affectation_moisture_reasoning": "Air currents here wick away moisture with an unnatural aridity.",
        "affectation_size_value": -2,
        "affectation_size_reasoning": "Cramped and oppressive, the space distorts and stretches in impossible ways.",
        "affectation_light_value": -3,
        "affectation_light_reasoning": "Weak, flickering lights barely reveal the steps ahead, shrouded in otherwordly darkness.",
        "affectation_sound_value": 2,
        "affectation_sound_reasoning": "Whispers from unknown sources confound senses, as sounds spiral down the staircase."
      },
      "Lair of Shadows": {
        "name": "Lair of Shadows",
        "description": "This chamber is thick with darkness; even the bravest souls fear to tread where shadows animate and slither along the walls.",
        "ambiance": "A palpable sense of being watched by unseen entities, as fleeting shapes twist in the periphery.",
        "affectation_moisture_value": -1,
        "affectation_moisture_reasoning": "The air is desiccated, filled with a cold that seeps into the bones.",
        "affectation_size_value": 0,
        "affectation_size_reasoning": "Though not vast, the room feels endless due to deceptive, shifting shadows.",
        "affectation_light_value": -3,
        "affectation_light_reasoning": "Negligible light sources render the room an abyss of near-complete darkness.",
        "affectation_sound_value": 1,
        "affectation_sound_reasoning": "Soft rustlings and whispers of the dark seem to come from nowhere and everywhere."
      },
      "Archives of the Damned": {
        "name": "Archives of the Damned",
        "description": "Shelves reach to the ceiling, laden with cursed texts and artifacts of a bygone era steeped in tragedy and evil.",
        "ambiance": "An uncanny stillness is felt amidst the rows of relics that seem to absorb all joy and light from the room.",
        "affectation_moisture_value": 0,
        "affectation_moisture_reasoning": "Neither damp nor completely dry, the air feels heavy with the weight of ancient curses.",
        "affectation_size_value": 1,
        "affectation_size_reasoning": "The chambers stretch far and wide with artifacts looming from all sides, oppressive with their malignant presence.",
        "affectation_light_value": -2,
        "affectation_light_reasoning": "Gas lamps struggle to remain lit, flickering under the oppressive darkness that seems to consume the light.",
        "affectation_sound_value": -2,
        "affectation_sound_reasoning": "The hushed echo of own footsteps is the only sound, yet an eerie feeling of whispered discourse remains."
      },
      "Hall of the Abyss": {
        "name": "Hall of the Abyss",
        "description": "A corridor lined with mirrors that don't reflect the present but rather the depravities and despair of all who look upon them.",
        "ambiance": "The smell of ozone and tormented airs engulfs anyone who dares traverse this hall.",
        "affectation_moisture_value": -2,
        "affectation_moisture_reasoning": "The parched air seems to draw moisture out of everything within this cursed hall.",
        "affectation_size_value": -1,
        "affectation_size_reasoning": "The encroaching walls adorned with mirrors create a suffocating experience, closing in on the psyche.",
        "affectation_light_value": -1,
        "affectation_light_reasoning": "The lighting, though present, dims inexplicably as one walks the hall, leaving only gloom and the illuminate past.",
        "affectation_sound_value": 2,
        "affectation_sound_reasoning": "Whispers from the mirrors sometimes grow into cacophonous roars, overwhelming all other senses."
      },
      "The Forsaken Parlor": {
        "name": "The Forsaken Parlor",
        "description": "A once-elegant sitting room, its lavish furniture now shrouded in cobwebs, reeking of abandonment and decay.",
        "ambiance": "The musty odor of mildew intermingles with the scent of aged velvet, the air thick with bygone opulence turned rotten.",
        "affectation_moisture_value": 1,
        "affectation_moisture_reasoning": "The residue of a time when laughter was common now dampens the fabric and walls with the tears of the forsaken.",
        "affectation_size_value": 0,
        "affectation_size_reasoning": "The parlor’s moderate size belies a once-warm chamber now host to cold desolation.",
        "affectation_light_value": -2,
        "affectation_light_reasoning": "Overcast light filters through heavy drapes, unwilling to fully reveal the room’s tragic neglect.",
        "affectation_sound_value": -1,
        "affectation_sound_reasoning": "The somber silence is occasionally fractured by the eerie creak of rocking chairs, rocking on their own accord."
      },
      "The Alchemist's Sanctum": {
        "name": "The Alchemist's Sanctum",
        "description": "A vault of otherworldly experiments, where the very air pulsates with forbidden alchemical energy.",
        "ambiance": "The scent of brimstone and mercury hangs over a chaos of flasks and arcane instruments, the residue of unholy research.",
        "affectation_moisture_value": -1,
        "affectation_moisture_reasoning": "An unnatural dryness pervades, each breath a subtle choking on the ashes of relentless pursuit of knowledge.",
        "affectation_size_value": -1,
        "affectation_size_reasoning": "A confined laboratory cluttered with the remnants of ethereal works, the space feels constrained by its own ambition.",
        "affectation_light_value": 0,
        "affectation_light_reasoning": "A surreal glow from otherworldly concoctions casts a spectrum of colors, offering illumination and darkness in equal measure.",
        "affectation_sound_value": 0,
        "affectation_sound_reasoning": "The occasional clink of glass and soft bubbling of potions layer over an oppressive silence."
      },
      "Gallery of the Macabre": {
        "name": "Gallery of the Macabre",
        "description": "A grim exhibition displaying unsettling portraits that seem to depict scenes of grotesque rituals and untimely demise.",
        "ambiance": "The air hangs heavy with a sense of being observed by the eyes within the frames, which seem to follow one's every movement.",
        "affectation_moisture_value": -1,
        "affectation_moisture_reasoning": "The dry air preserves the twisted artwork in haunting detail.",
        "affectation_size_value": 0,
        "affectation_size_reasoning": "The room is intimate enough to ensure there's no escaping the unnerving gaze of the depicted horrors.",
        "affectation_light_value": -3,
        "affectation_light_reasoning": "Darkness shrouds the gallery, with ominous glints of light that momentarily expose the ghastly artwork.",
        "affectation_sound_value": -1,
        "affectation_sound_reasoning": "A hushed silence envelops the space, punctuated only by the sound of one's own heartbeat."
      },
      "Antechamber of Shadows": {
        "name": "Antechamber of Shadows",
        "description": "A foreboding entryway to an uncharted part of the estate, where the shadows appear to slither and consume the light.",
        "ambiance": "An eerie chill sweeps through the chamber, as if the darkness itself breathes a frost born of deepest shade.",
        "affectation_moisture_value": -2,
        "affectation_moisture_reasoning": "The brittle air bites at the flesh, leaving skin parched and senses heightened to the creeping dread.",
        "affectation_size_value": -1,
        "affectation_size_reasoning": "The oppressive ceilings and constricting shadows play tricks on perception, feeling at once immense and claustrophobic.",
        "affectation_light_value": -3,
        "affectation_light_reasoning": "What little light dares enter is swiftly devoured by the all-consuming darkness.",
        "affectation_sound_value": 0,
        "affectation_sound_reasoning": "The absence of sound is a void, save for the softest rustling that suggests movement in the absence of wind."
      },
      "Vault of the Vanished": {
        "name": "Vault of the Vanished",
        "description": "A chilling room filled with empty garments and possessions of those who have disappeared without a trace.",
        "ambiance": "A heavy air of mystery and unresolved fate cloaks the vault, as if the very essences of the missing linger.",
        "affectation_moisture_value": 0,
        "affectation_moisture_reasoning": "Neither too moist nor too dry, the room is an eerie stasis of silent stories left untold.",
        "affectation_size_value": -1,
        "affectation_size_reasoning": "The items are arranged in such a way that the room feels overcrowded, yet echoes with the void of absence.",
        "affectation_light_value": -1,
        "affectation_light_reasoning": "The dim lighting casts long shadows over the remnants, leaving more questions than answers.",
        "affectation_sound_value": -2,
        "affectation_sound_reasoning": "The silence is profound, yet occasionally one might catch the faint murmur of a name whispered in vain."
      },
      "Arboretum of Gloom": {
        "name": "Arboretum of Gloom",
        "description": "Once a sanctuary of botanical beauty, now a decaying garden where plants have turned to twisted, thorny husks.",
        "ambiance": "A gloomy presence suffuses the air, thick with the scent of rot and flora mutated into grotesque parodies of life.",
        "affectation_moisture_value": 2,
        "affectation_moisture_reasoning": "The air is thick with the smell of damp earth and decaying leaves, fostering a suffocating closeness.",
        "affectation_size_value": 1,
        "affectation_size_reasoning": "The garden's enclosures encompass enough space to wander but are dense with twisted growth that ensnares both body and mind.",
        "affectation_light_value": -1,
        "affectation_light_reasoning": "Meager sunlight filters through the withered canopy, casting sickly hues upon all it touches.",
        "affectation_sound_value": 0,
        "affectation_sound_reasoning": "A profound silence reigns, occasionally broken by the rustling of leaves as though something unseen moves stealthily through."
      }
}
